> do you have an example or reproduction? If users do not specify password, then I don't believe this is required. It also depends on what attributes you are pulling from this output as well

Actually you are correct, the issue mostly happens since I use the module directly from Terragrunt.
I tried to use this module with an output.tf file and if I do this and don't output the users it works so apologies.

Never the less using this module directly from Terragrunt and even without using passwords block I still receive the error
This is my minimum config:

```terraform
  user_group_id = local.name

  default_user = {
    user_id              = "another-default"
    access_string        = "on ~* +@all"
  }

  users = {
    no_password = {
      access_string        = "on ~* +@all"
    }
  }
```

I still receive the error below

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_elasticache_user.default[0] will be created
  + resource "aws_elasticache_user" "default" {
      + access_string        = "on ~* +@all"
      + arn                  = (known after apply)
      + engine               = "REDIS"
      + id                   = (known after apply)
      + no_password_required = false
      + tags                 = {
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all             = {
          + "terraform-aws-modules" = "elasticache"
        }
      + user_id              = "another-default"
      + user_name            = "default"

      + authentication_mode (known after apply)
    }

  # aws_elasticache_user.this["no_password"] will be created
  + resource "aws_elasticache_user" "this" {
      + access_string        = "on ~* +@all"
      + arn                  = (known after apply)
      + engine               = "REDIS"
      + id                   = (known after apply)
      + no_password_required = false
      + tags                 = {
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all             = {
          + "terraform-aws-modules" = "elasticache"
        }
      + user_id              = "no_password"
      + user_name            = "no_password"

      + authentication_mode (known after apply)
    }

  # aws_elasticache_user_group.this[0] will be created
  + resource "aws_elasticache_user_group" "this" {
      + arn           = (known after apply)
      + engine        = "REDIS"
      + id            = (known after apply)
      + tags          = {
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all      = {
          + "terraform-aws-modules" = "elasticache"
        }
      + user_group_id = "example"
      + user_ids      = [
          + "another-default",
        ]
    }

  # aws_elasticache_user_group_association.this["no_password"] will be created
  + resource "aws_elasticache_user_group_association" "this" {
      + id            = (known after apply)
      + user_group_id = "example"
      + user_id       = "no_password"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + group_arn = (known after apply)
  + group_id  = (known after apply)
╷
│ Error: Output refers to sensitive values
│
│   on outputs.tf line 19:
│   19: output "users" {
│
│ To reduce the risk of accidentally exporting sensitive data that was
│ intended to be only internal, Terraform requires that any root module
│ output containing sensitive data be explicitly marked as sensitive, to
│ confirm your intent.
│
│ If you do intend to export this data, annotate the output value as
│ sensitive by adding the following argument:
│     sensitive = true
```

This can be resolved by either referencing another module which outputs only specific values or by adding sensitive to the users output.
I think it's mostly a Terragrunt issue so I think we can close this PR.
sorry for the hustle.